tap "homebrew/bundle"
tap "homebrew/services"
tap "oleg-koval/tap"

# CLI tools
brew "git"
brew "gh"
brew "fnm"
brew "uv"
brew "starship"
brew "zoxide"
brew "atuin"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "glow"
brew "btop"
brew "jq"
brew "yq"
brew "delta"
brew "tmux"
brew "neovim"
brew "displayplacer"
brew "goreleaser"

# GUI apps
cask "kitty"
cask "cursor"
cask "raycast"
cask "karabiner-elements"
cask "hammerspoon"
cask "aerospace"
cask "orbstack"
cask "1password-cli"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
